<template>
  <div class="container">
    <div class="listing">
      <listing-header/>

      <div class="listing__section">
        <div class="listing__section__divider"/>
        <span class="listing__section__title">
          Замок Пєскова Скала
        </span>
        <div class="listing__section__divider"/>
        Замок Пєскова Скала, без сумніву, заслуговує на те, щоб називатися феніксом польських замків. За свою бурхливу і довгу історію він багато разів руйнувався, був завойований, спалений, але щоразу відроджувався з попелу. Першу згадку про цей історичний замок можна знайти в одному з документів польського короля Владислава Локетека від 1315 року. Щоправда, він згадується під іншою назвою, ніж та, яку ми знаємо сьогодні – Пескенштейн. Швидше за все, король мав на увазі не відому нам сьогодні споруду, а укріплення, що виконували аналогічну функцію поблизу сусіднього села Сулошова. Оборонні укріплення в цій місцевості були створені для захисту долини Пронднік - головного шляху, що з'єднував Краків з Сілезією. Замок на його нинішньому місці був побудований за часів правління короля Казимира Великого в першій половині 14 століття. На той час він складався зі сторожової вежі, розташованої на скельному мисі. На неприступній скелі, що носила витончену назву Дороті, знаходилася найвища замкова вежа, яка виконувала житлові функції. Господарські будівлі, оточені оборонними мурами, ймовірно, знаходилися в околицях сучасного двору замку.

        <div class="listing__section__divider"/>
        <span class="listing__section__title">
          Рід Шафранецьких
        </span>
        <div class="listing__section__divider"/>
        Цей комплекс перебував у королівських руках до кінця 14 століття, коли король Угорщини Людовик І подарував його Петру Шафранцю, краківському підстолію. Цікаво, що це дарування було зумовлене зовсім не особливими заслугами підстолія, а стало компенсацією за поранення, яких він зазнав внаслідок суперечки з угорськими придворними короля. Зрештою, король Владислав Ягайло передав замок синові Петра, також Петру. Рід Шафранецьких довгий час зберігала сильні позиції навколо польського престолу, а її представники займали найвищі посади в країні. За їхніх часів замок зазнав подальших розширень: були побудовані дві величезні артилерійські вежі, а популярність італійської моди призвела до ренесансної реконструкції. Ще однією знаковою постаттю в історії Пєскової Скали був сандомирський воєвода Станіслав Шафранець, який, провівши молодість при дворі принца Альбрехта Гогенцоллерна, повернувся в країну вже кальвіністом. Він став речником релігійної толерантності в Польщі і значним захисником польських протестантів, зокрема видатного польського поета Миколая Рея. За часів Станіслава замок збагатився аркадним двором, лоджією та садами. На жаль, зі смертю його сина Єнджея у 1608 році чоловіча лінія роду Шафранів вимерла, і замок перейшов до рук інших родин.

        <div class="listing__section__divider"/>
        <span class="listing__section__title">
          Пізніша історія
        </span>
        <div class="listing__section__divider"/>
        У 17 столітті лянцкоронський староста Міхал Зебжидовський, як набожний католик, збагатив замок розкішною каплицею святого Михаїла та провів капітальну реновацію застарілих оборонних елементів замку. Незважаючи на реновацію, замок став жертвою військових дій під час Шведського потопу, коли він був зруйнований і пограбований загарбниками. Наступні реставрації були пов'язані з раптовим припливом коштів від соляних копалень у Бохні та Величці. На жаль, з часом він втратив недоцільні в польських умовах італійські клумби і лоджії, але в цей період отримав видатний дизайн інтер'єру. У 1850 році замок був знищений черговою пожежею - цього разу її наслідки виявилися трагічними, а через 3 роки через пошкодження завалився верхній замок, розташований на Скелі Дороті. У 19 столітті сильно занедбаний замок перейшов у власність акціонерного товариства, спеціально створеного для його порятунку, яке виділило його під розкішний гостьовий будинок. Опинившись у російській частині розділеної Польщі, замок втратив тісні зв'язки з Краковом і став місцем екскурсій для мешканців Варшави та всієї російської частини розділеної країни. Пансіонат функціонував у 1903-1939 роках. Під час Другої світової війни його віддали під дитячий будинок, де знайшли притулок сотні дітей, переважно зі східного прикордоння.

        <div class="listing__section__divider"/>
        <span class="listing__section__title">
          Сучасні часи
        </span>
        <div class="listing__section__divider"/>
        Коли туман війни розвіявся, замок був націоналізований і переданий Міністерству сільського господарства. У 1950 році він знову змінив власника і був переданий Міністерству культури і мистецтва. Завдяки архітектурним дослідженням вдалося виявити ренесансні архітектурні елементи та реконструювати аркадне подвір'я і оглядову лоджію. Розвиток замку було доручено Державній художній колекції Вавельського королівського замку. У 1970 році ворота Пєскової Скелі були відкриті для туристів. Відтоді замок переживає не пожежі, а ремонти та реконструкції, а саме місце стало справжньою перлиною польської музеології. У 2023 році замок відкрив свої двері для геокешингу.
      </div>
      <div class="listing__section">
        <div class="listing__section__divider"/>
        <span class="listing__section__title">
          Вхід на територію замку
        </span>
        <div class="listing__section__divider"/>
        Для того, щоб знайти цей тайник, необхідно відвідати територію замку, вхід на яку(<strong>крім понеділка - дня безкоштовного відвідування</strong>) є платним. Найдешевший квиток коштує 16 злотих (пільгова ціна 13 злотих) і включає в себе екскурсію по монастирях, Скелі Дороті та складу. <strong>Оплата квитка необхідна</strong> для того, щоб знайти цей тайник, але <strong>користуватися послугами гіда не обов'язково</strong> - після входу в замок ви можете залишити групу і вільно розгадати загадку. Сам фінальний тайник також захований на території замку.<br>
        <br>
        Вхід можливий кожні 20 або 30 хвилин у зазначений нижче час:<br>
        - Понеділок - 9:00-17:00<br>
        - Вівторок-П’ятниця - 9:20-17:00<br>
        - Субота, Неділя, Державні свята - 9:30-18:00<br>
        Години роботи можуть змінюватися у зв'язку з державними святами. Завжди актуальний список змін можна знайти за посиланням:<a href="https://pieskowaskala.eu/godziny-bilety" class="link"> Замок Пєскова Скала </a>
        <div class="listing__section__divider"/>
        <span class="listing__section__title">
          Геокеш
        </span>
        <div class="listing__section__divider"/>
        Для того, щоб знайти кеш, потрібно прочитати лістинг, вирішити 2 нескладні загадки та завітати на подвір'я замку Пєскова Скала. Вікторину №. 1 рекомендується розгадувати вдома, але ви можете зробити це і під час відвідування замку. Загадка № 2 вимагає, щоб ви відвідали внутрішній двір і розгадали її там.<br>
        <br>
        Загадка 1:<br>
        Ознайомтеся з лістингом кешу та розв'яжіть загадку за посиланням нижче:<br>
        <b><a href="https://learningapps.org/watch?v=p8u8eyp1t23" class="link"> Посилання на загадку № 1.</a></b><br>
        Ця загадка надасть вам код до <strong>ЛІВОГО</strong> замку і північні координати кеша.<br>
        <br>
        Загадка 2:<br>
        Завітайте на подвір'я замку Пєскова Скала та дайте відповіді на запитання загадки нижче:<br>
        <NuxtLink to="/Quiz2?lang=UA" class="link"> Посилання на загадку № 2.</NuxtLink><br>
        Ця загадка надасть вам код до <strong>ПРАВОГО</strong> замку і східні координати кеша.<br>
        <br />
        Після того, як ви знайшли тайник, будь ласка, переконайтеся, що ви залишили все в тому ж вигляді, в якому знайшли.<strong> Не плутайте замки і не грайтеся з ними </strong>, переконайтеся, що всі контейнери знаходяться в правильному місці, щоб їх не придавило кришкою. В якості винагороди візьміть сертифікат знахідки з промаркованого контейнера.
      </div>

      <div class="listing__section">
        <span class="listing__section__title">
          <a href="https://coord.info/GCA9WJX" class="link">
            Лістінґ кеша на Geocaching.com
          </a>
        </span>
      </div>

      <div class="listing__section">
        <logos/>
      </div>
    </div>
  </div>
</template>

<script>
import ListingHeader from "@/components/listingHeader.component.vue";

export default {
  name: "ListingUA",
  components: { ListingHeader }
};
</script>

<style scoped lang="scss">
.container {
  background-image: url("~@/assets/listing-bg.jpeg");
  background-repeat: repeat;
  max-width: 100%;
  min-height: 100vh;
  display: flex;
  justify-content: center;

  .listing {
    width: 1000px;
    max-width: calc(100% - 20px);
    padding: 50px;
    background-color: white;

    @media (max-width: 600px) {
      padding: 10px;
    }

    &__section {
      background: url("~@/assets/listing-text-bg.jpeg");
      border: 2px solid black;
      color: white;
      margin-bottom: 30px;
      margin-top: 30px;
      padding: 30px;

      @media (max-width: 600px) {
        padding: 10px;
      }

      &:last-child {
        margin-bottom: 0px;
      }

      &__divider {
        background: white;
        height: 1px;
        margin: 20px 5px;
        width: calc(100% - 10px);
      }

      &__title {
        display: inline-block;
        width: 100%;
        text-align: center;
        font-size: 24px;
        font-weight: bolder;
      }

      &__text {

      }
    }

    .link {
      color: white;
      text-decoration: underline;
      font-weight: bold;
    }
  }
}
</style>
